microhal/microhal/microhal/ports/stmCommon/registers/peripheralBaseAddressDefinitions/registersBaseAddressDefinitions_stm32f3x4.h
#ifndef _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F3X4_H_
#define _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F3X4_H_

#define _MICROHAL_UID_BASE_ADDRESS 0x1FFFF7AC
#define _MICROHAL_GPIOA_BASE_ADDRESS 0x48000000
#define _MICROHAL_GPIOB_BASE_ADDRESS 0x48000400
#define _MICROHAL_GPIOC_BASE_ADDRESS 0x48000800
#define _MICROHAL_GPIOD_BASE_ADDRESS 0x48000C00
#define _MICROHAL_GPIOF_BASE_ADDRESS 0x48001400
#define _MICROHAL_TSC_BASE_ADDRESS 0x40024000
#define _MICROHAL_CRC_BASE_ADDRESS 0x40023000
#define _MICROHAL_FLASH_BASE_ADDRESS 0x40022000
#define _MICROHAL_RCC_BASE_ADDRESS 0x40021000
#define _MICROHAL_DMA1_BASE_ADDRESS 0x40020000
#define _MICROHAL_TIM2_BASE_ADDRESS 0x40000000
#define _MICROHAL_TIM15_BASE_ADDRESS 0x40014000
#define _MICROHAL_TIM16_BASE_ADDRESS 0x40014400
#define _MICROHAL_TIM17_BASE_ADDRESS 0x40014800
#define _MICROHAL_USART1_BASE_ADDRESS 0x40013800
#define _MICROHAL_USART2_BASE_ADDRESS 0x40004400
#define _MICROHAL_USART3_BASE_ADDRESS 0x40004800
#define _MICROHAL_SPI2_BASE_ADDRESS 0x40003800
#define _MICROHAL_I2S2EXT_BASE_ADDRESS 0x40003400
#define _MICROHAL_I2S3EXT_BASE_ADDRESS 0x40004000
#define _MICROHAL_SPI3_BASE_ADDRESS 0x40003C00
#define _MICROHAL_SPI1_BASE_ADDRESS 0x40013000
#define _MICROHAL_EXTI_BASE_ADDRESS 0x40010400
#define _MICROHAL_PWR_BASE_ADDRESS 0x40007000
#define _MICROHAL_I2C1_BASE_ADDRESS 0x40005400
#define _MICROHAL_I2C3_BASE_ADDRESS 0x40007800
#define _MICROHAL_IWDG_BASE_ADDRESS 0x40003000
#define _MICROHAL_WWDG_BASE_ADDRESS 0x40002C00
#define _MICROHAL_RTC_BASE_ADDRESS 0x40002800
#define _MICROHAL_TIM6_BASE_ADDRESS 0x40001000
#define _MICROHAL_TIM7_BASE_ADDRESS 0x40001400
#define _MICROHAL_DAC1_BASE_ADDRESS 0x40007400
#define _MICROHAL_DAC2_BASE_ADDRESS 0x40009800
#define _MICROHAL_DBGMCU_BASE_ADDRESS 0xE0042000
#define _MICROHAL_TIM1_BASE_ADDRESS 0x40012C00
#define _MICROHAL_ADC1_BASE_ADDRESS 0x50000000
#define _MICROHAL_ADC2_BASE_ADDRESS 0x50000100
#define _MICROHAL_SYSCFG_COMP_OPAMP_BASE_ADDRESS 0x40010000
#define _MICROHAL_TIM3_BASE_ADDRESS 0x40000400
#define _MICROHAL_CAN_BASE_ADDRESS 0x40006400
#define _MICROHAL_ADC_COMMON_BASE_ADDRESS 0x50000300
#define _MICROHAL_HRTIM_MASTER_BASE_ADDRESS 0x40017400
#define _MICROHAL_HRTIM_TIMA_BASE_ADDRESS 0x40017480
#define _MICROHAL_HRTIM_TIMB_BASE_ADDRESS 0x40017500
#define _MICROHAL_HRTIM_TIMC_BASE_ADDRESS 0x40017580
#define _MICROHAL_HRTIM_TIMD_BASE_ADDRESS 0x40017600
#define _MICROHAL_HRTIM_TIME_BASE_ADDRESS 0x40017680
#define _MICROHAL_HRTIM_COMMON_BASE_ADDRESS 0x40017780
#define _MICROHAL_NVIC_BASE_ADDRESS 0xE000E100
#define _MICROHAL_FPU_BASE_ADDRESS 0xE000EF34
#define _MICROHAL_MPU_BASE_ADDRESS 0xE000ED90
#define _MICROHAL_STK_BASE_ADDRESS 0xE000E010
#define _MICROHAL_SCB_BASE_ADDRESS 0xE000ED00
#define _MICROHAL_NVIC_STIR_BASE_ADDRESS 0xE000EF00
#define _MICROHAL_FPU_CPACR_BASE_ADDRESS 0xE000ED88
#define _MICROHAL_SCB_ACTRL_BASE_ADDRESS 0xE000E008

#endif  // _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32F3X4_H_
